mehdinuri/CPU4v1/CPM/CP/App/Adapters/STM32/FieldInputCanAdapter.c
/* App/Adapters/STM32/FieldInputCanAdapter.c
 *
 * FDCAN1 field input adapter for FEIG loop detectors and legacy pedestrian
 * inputs. FEIG occupancy is consumed from TPDO1 when available and from
 * legacy 0x580+node SDO responses as a compatibility fallback. Low-rate
 * 210x.sub4/sub5 polling is retained for per-loop offline/fault detail.
 */
#include "FieldInputCanAdapter.h"

#include <string.h>

#include "cmsis_os2.h"
#include "FieldCanQueueTx.h"
#include "LegacyFieldCanIds.h"
#include "stm32h7xx_hal.h"

#define FIELD_INPUT_FEIG_NODE_COUNT 8U
#define FIELD_INPUT_FEIG_LOOPS_PER_NODE 4U
#define FIELD_INPUT_FEIG_TPDO1_BASE 0x180U
#define FIELD_INPUT_FEIG_SDO_RESPONSE_BASE 0x580U
#define FIELD_INPUT_FEIG_SDO_REQUEST_BASE LEGACY_FIELD_CAN_ID_LOOP_SDO_REQUEST_BASE
#define FIELD_INPUT_FEIG_HEARTBEAT_BASE 0x700U
#define FIELD_INPUT_FEIG_EMCY_BASE 0x300U
#define FIELD_INPUT_PED_LEGACY_BASE LEGACY_FIELD_CAN_ID_IO_INPUTS0
#define FIELD_INPUT_PSM_MEASURE_BASE 0x05AU

#define FIELD_INPUT_FEIG_TIMEOUT_MS 1500U
#define FIELD_INPUT_PED_TIMEOUT_MS 500U
#define FIELD_INPUT_FEIG_STARTUP_INTERVAL_MS 50U
#define FIELD_INPUT_FEIG_HEALTH_POLL_INTERVAL_MS 100U
#define FIELD_INPUT_RX_DEPTH 32U

#define FIELD_INPUT_DETECTOR_ALARM_COMMUNICATIONS 0x08U
#define FIELD_INPUT_REPORTED_ALARM_OTHER 0x01U

typedef struct
{
  uint16_t standardId;
  uint8_t length;
  uint8_t data[8];
} FieldInputQueuedFrame_t;

static FieldInputCanAdapterCtx_t *s_registeredCtx = NULL;

static uint16_t ReadLe16(const uint8_t *data)
{
  return (uint16_t) ((uint16_t) data[0] | ((uint16_t) data[1] << 8U));
}

static uint16_t ReadPsmField(uint8_t low, uint8_t high)
{
  return (uint16_t) (low + ((uint16_t) high << 8U));
}

static uint32_t CurrentTickMs(void)
{
  return HAL_GetTick();
}

static void CreateOsObjects(FieldInputCanAdapterCtx_t *ctx)
{
  if (ctx == NULL)
  {
    return;
  }

  if (ctx->rxPool == NULL)
  {
    ctx->rxPool = osMemoryPoolNew(FIELD_INPUT_RX_DEPTH,
                                  sizeof(FieldInputQueuedFrame_t),
                                  NULL);
  }

  if (ctx->rxQueue == NULL)
  {
    ctx->rxQueue = osMessageQueueNew(FIELD_INPUT_RX_DEPTH,
                                     sizeof(FieldInputQueuedFrame_t *),
                                     NULL);
  }
}

static void SeedSnapshot(FieldInputCanAdapterCtx_t *ctx)
{
  uint8_t index;

  if (ctx == NULL)
  {
    return;
  }

  for (index = 0U; index < 2U; index++)
  {
    memset(&ctx->snapshots[index], 0, sizeof(ctx->snapshots[index]));
    ctx->snapshots[index].protocolVersion = MODULE_BUS_PROTOCOL_VERSION;
    ctx->snapshots[index].configEpoch = ctx->configEpoch;
  }

  ctx->activeSnapshotIndex = 0U;
  ctx->hasSnapshot = 0U;
}

static void SendStandardCanFrame(uint16_t identifier,
                                 const uint8_t *data,
                                 uint8_t length)
{
  uint8_t payload[8];

  if ((data == NULL) || (length > sizeof(payload)))
  {
    return;
  }

  memset(payload, 0, sizeof(payload));
  memcpy(payload, data, length);
  (void) FieldCanQueueTxSendStandard(identifier, payload, length);
}

static void SendNmtCommand(uint8_t commandSpecifier, uint8_t nodeId)
{
  uint8_t payload[2];

  payload[0] = commandSpecifier;
  payload[1] = nodeId;
  SendStandardCanFrame(LEGACY_FIELD_CAN_ID_LOOP_NMT,
                       payload,
                       sizeof(payload));
}

static void SendSdoWrite1Byte(uint8_t nodeId,
                              uint16_t index,
                              uint8_t subindex,
                              uint8_t value)
{
  uint8_t payload[8] = {
    0x2FU,
    (uint8_t) (index & 0xFFU),
    (uint8_t) ((index >> 8U) & 0xFFU),
    subindex,
    value,
    0U,
    0U,
    0U
  };

  SendStandardCanFrame((uint16_t) (FIELD_INPUT_FEIG_SDO_REQUEST_BASE + nodeId
                                   - 1U),
                       payload,
                       sizeof(payload));
}

static void SendSdoWrite2Byte(uint8_t nodeId,
                              uint16_t index,
                              uint8_t subindex,
                              uint16_t value)
{
  uint8_t payload[8] = {
    0x2BU,
    (uint8_t) (index & 0xFFU),
    (uint8_t) ((index >> 8U) & 0xFFU),
    subindex,
    (uint8_t) (value & 0xFFU),
    (uint8_t) ((value >> 8U) & 0xFFU),
    0U,
    0U
  };

  SendStandardCanFrame((uint16_t) (FIELD_INPUT_FEIG_SDO_REQUEST_BASE + nodeId
                                   - 1U),
                       payload,
                       sizeof(payload));
}

static void SendSdoWrite4Byte(uint8_t nodeId,
                              uint16_t index,
                              uint8_t subindex,
                              uint32_t value)
{
  uint8_t payload[8] = {
    0x23U,
    (uint8_t) (index & 0xFFU),
    (uint8_t) ((index >> 8U) & 0xFFU),
    subindex,
    (uint8_t) (value & 0xFFU),
    (uint8_t) ((value >> 8U) & 0xFFU),
    (uint8_t) ((value >> 16U) & 0xFFU),
    (uint8_t) ((value >> 24U) & 0xFFU)
  };

  SendStandardCanFrame((uint16_t) (FIELD_INPUT_FEIG_SDO_REQUEST_BASE + nodeId
                                   - 1U),
                       payload,
                       sizeof(payload));
}

static void SendSdoRead(uint8_t nodeId,
                        uint16_t index,
                        uint8_t subindex)
{
  uint8_t payload[8] = {
    0x40U,
    (uint8_t) (index & 0xFFU),
    (uint8_t) ((index >> 8U) & 0xFFU),
    subindex,
    0U,
    0U,
    0U,
    0U
  };

  SendStandardCanFrame((uint16_t) (FIELD_INPUT_FEIG_SDO_REQUEST_BASE + nodeId
                                   - 1U),
                       payload,
                       sizeof(payload));
}

static uint8_t NodeIndexToNodeId(uint8_t nodeIndex)
{
  return (uint8_t) (nodeIndex + 1U);
}

static uint8_t GetNodeIndexFromStandardId(uint32_t identifier,
                                          uint16_t base,
                                          uint8_t *nodeIndex)
{
  uint32_t nodeId;

  if ((nodeIndex == NULL) || (identifier < base))
  {
    return 0U;
  }

