mehdinuri/CPU4v1/CPM/CP/App/Adapters/STM32/FieldInputCanAdapter.c
  nodeId = identifier - base;
  if ((nodeId == 0U) || (nodeId > FIELD_INPUT_FEIG_NODE_COUNT))
  {
    return 0U;
  }

  *nodeIndex = (uint8_t) (nodeId - 1U);

  return 1U;
}

static void DecodeFeigInputByte(uint8_t rawByte,
                                uint8_t *occupancyMask,
                                uint8_t *safeMask)
{
  uint8_t decoded = (uint8_t) (0xFFU - rawByte);

  if (occupancyMask != NULL)
  {
    *occupancyMask = (uint8_t) (decoded & 0x0FU);
  }

  if (safeMask != NULL)
  {
    *safeMask = (uint8_t) ((decoded >> 4U) & 0x0FU);
  }
}

static void RebuildSnapshot(FieldInputCanAdapterCtx_t *ctx)
{
  ModuleBusSnapshot_t nextSnapshot;
  uint8_t nodeIndex;
  uint8_t nextIndex;
  uint8_t anyFeigValid = 0U;
  uint8_t anyFeigFresh = 0U;
  uint8_t anyPedValid = 0U;
  uint8_t anyPedFresh = 0U;
  uint8_t diagnosticsValid = 0U;
  uint8_t diagnosticsFresh = 0U;
  uint32_t now;

  if (ctx == NULL)
  {
    return;
  }

  nextSnapshot = ctx->snapshots[ctx->activeSnapshotIndex];
  memset(&nextSnapshot.vehicleDetectorAlarms[0],
         0,
         sizeof(nextSnapshot.vehicleDetectorAlarms));
  memset(&nextSnapshot.vehicleDetectorReportedAlarms[0],
         0,
         sizeof(nextSnapshot.vehicleDetectorReportedAlarms));
  memset(&nextSnapshot.pedestrianDetectorAlarms[0],
         0,
         sizeof(nextSnapshot.pedestrianDetectorAlarms));
  nextSnapshot.protocolVersion = MODULE_BUS_PROTOCOL_VERSION;
  nextSnapshot.configEpoch = ctx->configEpoch;
  nextSnapshot.validMask = 0U;
  nextSnapshot.healthMask = 0U;
  nextSnapshot.staleMask = 0U;
  nextSnapshot.contextFaultMask = 0U;
  nextSnapshot.sequenceFaultMask = 0U;
  nextSnapshot.detectorInputs = 0U;
  nextSnapshot.pedInputs = 0U;
  nextSnapshot.rawVehicleDetectorInputs = 0U;
  nextSnapshot.rawVehicleDetectorOffline = 0U;
  nextSnapshot.rawVehicleDetectorFault = 0U;
  nextSnapshot.rawPedestrianInputs = 0U;
  now = CurrentTickMs();

  for (nodeIndex = 0U; nodeIndex < FIELD_INPUT_FEIG_NODE_COUNT; nodeIndex++)
  {
    uint8_t loopIndex;
    uint8_t nodeFresh = 0U;
    uint8_t nodeSeen =
      (uint8_t) ((ctx->feigLastStatusTick[nodeIndex] != 0U)
                 || (ctx->feigLastHeartbeatTick[nodeIndex] != 0U));

    if (nodeSeen != 0U)
    {
      anyFeigValid = 1U;
      nodeFresh = (uint8_t) (((now - ctx->feigLastStatusTick[nodeIndex])
                              <= FIELD_INPUT_FEIG_TIMEOUT_MS)
                             || ((now - ctx->feigLastHeartbeatTick[nodeIndex])
                                 <= FIELD_INPUT_FEIG_TIMEOUT_MS));
      if (nodeFresh != 0U)
      {
        anyFeigFresh = 1U;
      }
    }

    diagnosticsValid = (uint8_t) (diagnosticsValid
                                  || (ctx->feigLastStatusTick[nodeIndex] != 0U)
                                  || (ctx->feigLastHeartbeatTick[nodeIndex] != 0U));
    diagnosticsFresh = (uint8_t) (diagnosticsFresh || (nodeFresh != 0U));

    for (loopIndex = 0U; loopIndex < FIELD_INPUT_FEIG_LOOPS_PER_NODE;
         loopIndex++)
    {
      uint8_t detectorNumber =
        (uint8_t) ((nodeIndex * FIELD_INPUT_FEIG_LOOPS_PER_NODE) + loopIndex
                   + 1U);
      uint32_t mask = (uint32_t) (1UL << (uint32_t) (detectorNumber - 1U));

      if (nodeFresh != 0U)
      {
        if ((ctx->feigOccupancy[nodeIndex] & (uint8_t) (1U << loopIndex)) != 0U)
        {
          nextSnapshot.rawVehicleDetectorInputs |= mask;
          nextSnapshot.detectorInputs |= mask;
        }

        if ((ctx->feigOffline[nodeIndex] & (uint8_t) (1U << loopIndex)) != 0U)
        {
          nextSnapshot.rawVehicleDetectorOffline |= mask;
          nextSnapshot.vehicleDetectorReportedAlarms[detectorNumber - 1U] |=
            FIELD_INPUT_REPORTED_ALARM_OTHER;
        }

        if ((ctx->feigFault[nodeIndex] & (uint8_t) (1U << loopIndex)) != 0U)
        {
          nextSnapshot.rawVehicleDetectorFault |= mask;
          nextSnapshot.vehicleDetectorReportedAlarms[detectorNumber - 1U] |=
            FIELD_INPUT_REPORTED_ALARM_OTHER;
        }
      }
      else if (nodeSeen != 0U)
      {
        nextSnapshot.vehicleDetectorAlarms[detectorNumber - 1U] |=
          FIELD_INPUT_DETECTOR_ALARM_COMMUNICATIONS;
      }
    }
  }

  for (nodeIndex = 0U; nodeIndex < 2U; nodeIndex++)
  {
    uint8_t pedIndex;
    uint8_t moduleSeen = (uint8_t) (ctx->pedLegacyLastTick[nodeIndex] != 0U);
    uint8_t moduleFresh = 0U;

    if (moduleSeen != 0U)
    {
      anyPedValid = 1U;
      moduleFresh = (uint8_t) ((now - ctx->pedLegacyLastTick[nodeIndex])
                               <= FIELD_INPUT_PED_TIMEOUT_MS);
      if (moduleFresh != 0U)
      {
        anyPedFresh = 1U;
      }
    }

    diagnosticsValid = (uint8_t) (diagnosticsValid || (moduleSeen != 0U));
    diagnosticsFresh = (uint8_t) (diagnosticsFresh || (moduleFresh != 0U));

    for (pedIndex = 0U; pedIndex < 16U; pedIndex++)
    {
      uint8_t detectorNumber = (uint8_t) ((nodeIndex * 16U) + pedIndex + 1U);
      uint32_t mask = (uint32_t) (1UL << (uint32_t) (detectorNumber - 1U));

      if (moduleFresh != 0U)
      {
        if ((ctx->pedLegacyActive[nodeIndex] & (uint16_t) (1U << pedIndex))
            != 0U)
        {
          nextSnapshot.rawPedestrianInputs |= mask;
          nextSnapshot.pedInputs |= mask;
        }
      }
      else if (moduleSeen != 0U)
      {
        nextSnapshot.pedestrianDetectorAlarms[detectorNumber - 1U] |=
          FIELD_INPUT_DETECTOR_ALARM_COMMUNICATIONS;
      }
    }
  }

  if (anyFeigValid != 0U)
  {
    nextSnapshot.validMask |= MODULE_BUS_SNAPSHOT_VALID_DETECTORS;
    nextSnapshot.healthMask |= MODULE_BUS_SNAPSHOT_VALID_DETECTORS;

    if (anyFeigFresh == 0U)
    {
      nextSnapshot.staleMask |= MODULE_BUS_SNAPSHOT_VALID_DETECTORS;
    }
  }

  if (anyPedValid != 0U)
  {
    nextSnapshot.validMask |= MODULE_BUS_SNAPSHOT_VALID_PEDS;
    nextSnapshot.healthMask |= MODULE_BUS_SNAPSHOT_VALID_PEDS;

    if (anyPedFresh == 0U)
    {
      nextSnapshot.staleMask |= MODULE_BUS_SNAPSHOT_VALID_PEDS;
    }
  }

  if (diagnosticsValid != 0U)
  {
    nextSnapshot.validMask |= MODULE_BUS_SNAPSHOT_VALID_DETECTOR_DIAGNOSTICS;
    nextSnapshot.healthMask |= MODULE_BUS_SNAPSHOT_VALID_DETECTOR_DIAGNOSTICS;

    if (diagnosticsFresh == 0U)
    {
      nextSnapshot.staleMask |= MODULE_BUS_SNAPSHOT_VALID_DETECTOR_DIAGNOSTICS;
    }
  }

