mehdinuri/CPU4v1/CPM/CP/App/Adapters/STM32/FieldInputCanAdapter.c
  nextIndex = (uint8_t) (ctx->activeSnapshotIndex ^ 1U);
  ctx->snapshots[nextIndex] = nextSnapshot;
  ctx->activeSnapshotIndex = nextIndex;
  ctx->hasSnapshot = 1U;
}

static uint8_t SnapshotRead(void *ctx, ModuleBusSnapshot_t *snapshot)
{
  FieldInputCanAdapterCtx_t *adapterCtx = (FieldInputCanAdapterCtx_t *) ctx;
  uint8_t beforeIndex;
  uint8_t afterIndex;

  if ((adapterCtx == NULL) || (snapshot == NULL)
      || (adapterCtx->hasSnapshot == 0U))
  {
    return 0U;
  }

  do
  {
    beforeIndex = adapterCtx->activeSnapshotIndex;
    *snapshot = adapterCtx->snapshots[beforeIndex];
    afterIndex = adapterCtx->activeSnapshotIndex;
  } while (beforeIndex != afterIndex);

  return 1U;
}

static uint8_t SetConfigEpoch(void *ctx, uint16_t configEpoch)
{
  FieldInputCanAdapterSetConfigEpoch((FieldInputCanAdapterCtx_t *) ctx,
                                     configEpoch);

  return 1U;
}

static uint8_t CommandDetectorReset(void *ctx,
                                    ModuleBusDetectorClass_t detectorClass,
                                    uint8_t detectorNumber)
{
  FieldInputCanAdapterCtx_t *adapterCtx = (FieldInputCanAdapterCtx_t *) ctx;
  uint8_t nodeIndex;

  if ((adapterCtx == NULL) || (detectorNumber == 0U))
  {
    return 0U;
  }

  if (detectorClass == MODULE_BUS_DETECTOR_CLASS_VEHICLE)
  {
    if (detectorNumber > INTERSECTION_VEHICLE_DETECTOR_COUNT_MAX)
    {
      return 0U;
    }

    nodeIndex = (uint8_t) ((detectorNumber - 1U) / FIELD_INPUT_FEIG_LOOPS_PER_NODE);
    SendNmtCommand(0x81U, NodeIndexToNodeId(nodeIndex));
    adapterCtx->feigStartupStage[nodeIndex] = 0U;
    adapterCtx->feigNextStartupTick[nodeIndex] =
      CurrentTickMs() + FIELD_INPUT_FEIG_STARTUP_INTERVAL_MS;

    return 1U;
  }

  return 0U;
}

static void HandleFeigStartup(FieldInputCanAdapterCtx_t *ctx,
                              uint8_t nodeIndex,
                              uint32_t now)
{
  uint8_t nodeId;

  if ((ctx == NULL) || (nodeIndex >= FIELD_INPUT_FEIG_NODE_COUNT)
      || (now < ctx->feigNextStartupTick[nodeIndex]))
  {
    return;
  }

  nodeId = NodeIndexToNodeId(nodeIndex);

  switch (ctx->feigStartupStage[nodeIndex])
  {
      case 0U:
      {
        SendSdoWrite4Byte(nodeId, 0x1014U, 0U, (uint32_t) (0x300U + nodeId));
        break;
      }

      case 1U:
      {
        SendSdoWrite2Byte(nodeId, 0x1017U, 0U, 1000U);
        break;
      }

      case 2U:
      {
        SendSdoWrite1Byte(nodeId, 0x1800U, 2U, 255U);
        break;
      }

      case 3U:
      {
        SendSdoWrite2Byte(nodeId, 0x1800U, 3U, 0U);
        break;
      }

      case 4U:
      {
        SendSdoWrite2Byte(nodeId, 0x1800U, 5U, 0U);
        break;
      }

      case 5U:
      {
        SendNmtCommand(0x01U, nodeId);
        break;
      }

      default:
      {
        return;
      }
  }

  ctx->feigStartupStage[nodeIndex]++;
  ctx->feigNextStartupTick[nodeIndex] = now + FIELD_INPUT_FEIG_STARTUP_INTERVAL_MS;
}

static void PollFeigDiagnostics(FieldInputCanAdapterCtx_t *ctx, uint32_t now)
{
  uint8_t nodeId;
  uint16_t objectIndex;

  if ((ctx == NULL) || (now < ctx->nextHealthPollTick))
  {
    return;
  }

  nodeId = NodeIndexToNodeId(ctx->nextHealthPollNode);
  objectIndex = (uint16_t) (0x2101U + ctx->nextHealthPollLoop);
  SendSdoRead(nodeId, objectIndex, ctx->nextHealthPollSubindex);

  if (ctx->nextHealthPollSubindex == 4U)
  {
    ctx->nextHealthPollSubindex = 5U;
  }
  else
  {
    ctx->nextHealthPollSubindex = 4U;
    ctx->nextHealthPollLoop++;
    if (ctx->nextHealthPollLoop >= FIELD_INPUT_FEIG_LOOPS_PER_NODE)
    {
      ctx->nextHealthPollLoop = 0U;
      ctx->nextHealthPollNode++;
      if (ctx->nextHealthPollNode >= FIELD_INPUT_FEIG_NODE_COUNT)
      {
        ctx->nextHealthPollNode = 0U;
      }
    }
  }

  ctx->nextHealthPollTick = now + FIELD_INPUT_FEIG_HEALTH_POLL_INTERVAL_MS;
}

void FieldInputCanAdapterOnRxIsr(const FDCAN_RxHeaderTypeDef *header,
                                 const uint8_t *data)
{
  FieldInputCanAdapterCtx_t *ctx = s_registeredCtx;
  FieldInputQueuedFrame_t *queuedFrame;

  if ((ctx == NULL) || (header == NULL) || (data == NULL)
      || (header->IdType != FDCAN_STANDARD_ID)
      || (header->RxFrameType != FDCAN_DATA_FRAME))
  {
    return;
  }

  if ((ctx->rxPool == NULL) || (ctx->rxQueue == NULL))
  {
    ctx->droppedFrames++;
    return;
  }

  queuedFrame = (FieldInputQueuedFrame_t *) osMemoryPoolAlloc(ctx->rxPool, 0U);
  if (queuedFrame == NULL)
  {
    ctx->droppedFrames++;
    return;
  }

  queuedFrame->standardId = (uint16_t) header->Identifier;
  queuedFrame->length = (uint8_t) header->DataLength;
  if (queuedFrame->length > sizeof(queuedFrame->data))
  {
    queuedFrame->length = sizeof(queuedFrame->data);
  }

  (void) memcpy(&queuedFrame->data[0], data, queuedFrame->length);

  if (osMessageQueuePut(ctx->rxQueue, &queuedFrame, 0U, 0U) != osOK)
  {
    (void) osMemoryPoolFree(ctx->rxPool, queuedFrame);
    ctx->droppedFrames++;
  }
}

void FieldInputCanAdapterInit(FieldInputCanAdapterCtx_t *ctx,
                              uint16_t configEpoch,
                              UiPowerService_t *powerService)
{
  if (ctx == NULL)
  {
    return;
  }

  memset(ctx, 0, sizeof(*ctx));
  CreateOsObjects(ctx);
  ctx->configEpoch = configEpoch;
  ctx->powerService = powerService;
  ctx->nextHealthPollSubindex = 4U;
  SeedSnapshot(ctx);
  s_registeredCtx = ctx;
}

void FieldInputCanAdapterSetConfigEpoch(FieldInputCanAdapterCtx_t *ctx,
                                        uint16_t configEpoch)
{
  if (ctx == NULL)
  {
    return;
  }

  ctx->configEpoch = configEpoch;
  SeedSnapshot(ctx);
}

IModuleBusPort_t FieldInputCanAdapterCreatePort(FieldInputCanAdapterCtx_t *ctx)
{
  IModuleBusPort_t port;

  port.ctx = ctx;
  port.ReadSnapshot = SnapshotRead;
  port.SetConfigEpoch = SetConfigEpoch;
  port.CommandDetectorReset = CommandDetectorReset;

  return port;
}

static void ProcessRxFrame(FieldInputCanAdapterCtx_t *ctx,
                           uint16_t standardId,
                           uint8_t length,
                           const uint8_t *data)
{
  uint32_t now;

  if ((ctx == NULL) || (data == NULL))
  {
    return;
  }

  now = CurrentTickMs();

  if ((standardId >= FIELD_INPUT_PSM_MEASURE_BASE)
      && (standardId < (uint16_t) (FIELD_INPUT_PSM_MEASURE_BASE + 2U))
      && (length >= 8U) && (ctx->powerService != NULL))
  {
    UiPowerMeasurement_t measurement;
    uint8_t psmNumber = (uint8_t) ((standardId - FIELD_INPUT_PSM_MEASURE_BASE)
                                   + 1U);

