mehdinuri/CPU4v1/CPM/CP/App/Adapters/STM32/FieldInputCanAdapter.c
    (void) memset(&measurement, 0, sizeof(measurement));
    measurement.netVoltageRaw =
      ReadPsmField(data[0], (uint8_t) (data[5] & 0x03U));
    measurement.voltage24v1Raw =
      ReadPsmField(data[1], (uint8_t) ((data[5] >> 2U) & 0x03U));
    measurement.voltage24v2Raw =
      ReadPsmField(data[2], (uint8_t) ((data[5] >> 4U) & 0x03U));
    measurement.voltage5v1Raw =
      ReadPsmField(data[3], (uint8_t) ((data[5] >> 6U) & 0x03U));
    measurement.voltage5v2Raw =
      ReadPsmField(data[4], (uint8_t) (data[6] & 0x03U));
    measurement.isolatedVoltagePresent =
      (uint8_t) ((data[6] & 0x04U) != 0U);
    measurement.netFrequencyRaw = data[7];
    measurement.valid = 1U;
    UiPowerServiceUpdateMeasurement(ctx->powerService, psmNumber, &measurement);
    return;
  }

  if ((standardId == FIELD_INPUT_PED_LEGACY_BASE)
      || (standardId == (FIELD_INPUT_PED_LEGACY_BASE + 1U)))
  {
    uint8_t moduleIndex = (uint8_t) (standardId - FIELD_INPUT_PED_LEGACY_BASE);

    if (length >= 2U)
    {
      ctx->pedLegacyActive[moduleIndex] = (uint16_t) (~ReadLe16(data));
      ctx->pedLegacyLastTick[moduleIndex] = now;
      RebuildSnapshot(ctx);
    }

    return;
  }

  if ((standardId >= FIELD_INPUT_FEIG_TPDO1_BASE + 1U)
      && (standardId <= FIELD_INPUT_FEIG_TPDO1_BASE
          + FIELD_INPUT_FEIG_NODE_COUNT))
  {
    uint8_t nodeIndex;

    if ((length >= 1U)
        && (GetNodeIndexFromStandardId(standardId,
                                       FIELD_INPUT_FEIG_TPDO1_BASE,
                                       &nodeIndex) != 0U))
    {
      DecodeFeigInputByte(data[0],
                          &ctx->feigOccupancy[nodeIndex],
                          NULL);
      ctx->feigLastStatusTick[nodeIndex] = now;
      RebuildSnapshot(ctx);
    }

    return;
  }

  if ((standardId >= FIELD_INPUT_FEIG_SDO_RESPONSE_BASE + 1U)
      && (standardId <= FIELD_INPUT_FEIG_SDO_RESPONSE_BASE
          + FIELD_INPUT_FEIG_NODE_COUNT))
  {
    uint8_t nodeIndex;

    if (GetNodeIndexFromStandardId(standardId,
                                   FIELD_INPUT_FEIG_SDO_RESPONSE_BASE,
                                   &nodeIndex) == 0U)
    {
      return;
    }

    if ((length >= 5U)
        && (ReadLe16(&data[1]) == 0x6000U)
        && (data[3] == 1U))
    {
      DecodeFeigInputByte(data[4], &ctx->feigOccupancy[nodeIndex], NULL);
      ctx->feigLastStatusTick[nodeIndex] = now;
      RebuildSnapshot(ctx);
      return;
    }

    if ((length >= 5U)
        && (ReadLe16(&data[1]) >= 0x2101U)
        && (ReadLe16(&data[1]) <= 0x2104U)
        && ((data[3] == 4U) || (data[3] == 5U)))
    {
      uint8_t loopIndex = (uint8_t) (ReadLe16(&data[1]) - 0x2101U);
      uint8_t loopMask = (uint8_t) (1U << loopIndex);

      if (data[3] == 4U)
      {
        if (data[4] != 0U)
        {
          ctx->feigOffline[nodeIndex] |= loopMask;
        }
        else
        {
          ctx->feigOffline[nodeIndex] &= (uint8_t) ~loopMask;
        }
      }
      else
      {
        if (data[4] != 0U)
        {
          ctx->feigFault[nodeIndex] |= loopMask;
        }
        else
        {
          ctx->feigFault[nodeIndex] &= (uint8_t) ~loopMask;
        }
      }

      ctx->feigLastHeartbeatTick[nodeIndex] = now;
      RebuildSnapshot(ctx);
    }

    return;
  }

  if ((standardId >= FIELD_INPUT_FEIG_HEARTBEAT_BASE + 1U)
      && (standardId <= FIELD_INPUT_FEIG_HEARTBEAT_BASE
          + FIELD_INPUT_FEIG_NODE_COUNT))
  {
    uint8_t nodeIndex;

    if ((length >= 1U)
        && (GetNodeIndexFromStandardId(standardId,
                                       FIELD_INPUT_FEIG_HEARTBEAT_BASE,
                                       &nodeIndex) != 0U))
    {
      ctx->feigLastHeartbeatTick[nodeIndex] = now;
      if (data[0] == 0x00U)
      {
        ctx->feigStartupStage[nodeIndex] = 0U;
        ctx->feigNextStartupTick[nodeIndex] = now + 10U;
      }
      RebuildSnapshot(ctx);
    }

    return;
  }

  if ((standardId >= FIELD_INPUT_FEIG_EMCY_BASE + 1U)
      && (standardId <= FIELD_INPUT_FEIG_EMCY_BASE
          + FIELD_INPUT_FEIG_NODE_COUNT))
  {
    uint8_t nodeIndex;

    if (GetNodeIndexFromStandardId(standardId,
                                   FIELD_INPUT_FEIG_EMCY_BASE,
                                   &nodeIndex) != 0U)
    {
      ctx->feigLastHeartbeatTick[nodeIndex] = now;
      RebuildSnapshot(ctx);
    }
  }
}

void FieldInputCanAdapterStep(void)
{
  FieldInputCanAdapterCtx_t *ctx = s_registeredCtx;
  FieldInputQueuedFrame_t *queuedFrame = NULL;
  uint8_t nodeIndex;
  uint32_t now;

  if (ctx == NULL)
  {
    return;
  }

  while ((ctx->rxQueue != NULL)
         && (osMessageQueueGet(ctx->rxQueue, &queuedFrame, NULL, 0U) == osOK))
  {
    if (queuedFrame != NULL)
    {
      ProcessRxFrame(ctx,
                     queuedFrame->standardId,
                     queuedFrame->length,
                     &queuedFrame->data[0]);
      (void) osMemoryPoolFree(ctx->rxPool, queuedFrame);
    }
  }

  now = CurrentTickMs();

  for (nodeIndex = 0U; nodeIndex < FIELD_INPUT_FEIG_NODE_COUNT; nodeIndex++)
  {
    HandleFeigStartup(ctx, nodeIndex, now);
  }

  PollFeigDiagnostics(ctx, now);
  RebuildSnapshot(ctx);
}
